### GroupBy

In [2]:
import pandas as pd

In [3]:
# Criando um dataframe
data = {"Empresa":["GOOG", "GOOG", "MSFT", "MSFT", "FB", "FB"],
       "Nome":["Sam", "Charlie", "Amy", "Ismael", "Carl", "Sarah"],
       "Venda":[200, 120, 340, 124, 243, 350]}

In [4]:
# Convertendo em um data frame
df = pd.DataFrame(data); df

  Empresa     Nome  Venda
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT   Ismael    124
4      FB     Carl    243
5      FB    Sarah    350

In [6]:
# Fazendo o agrupamento de dados com o método .groupby() e utilizando o método sum() para somar os dados de vendas
df.groupby("Empresa")[["Venda"]].sum()

         Venda
Empresa
FB         593
GOOG       320
MSFT       464

In [8]:
# Fazendo o agrupamento de dados com o método .groupby() e utilizando o método mean() para tirar a média das vendas
df.groupby("Empresa")[["Venda"]].mean()

         Venda
Empresa
FB       296.5
GOOG     160.0
MSFT     232.0

In [10]:
# Um método bastante útil describe() vai te forncer dados estatísticos bastante relevantes 
df.groupby("Empresa").describe()

        Venda
        count   mean         std    min     25%    50%     75%    max
Empresa
FB        2.0  296.5   75.660426  243.0  269.75  296.5  323.25  350.0
GOOG      2.0  160.0   56.568542  120.0  140.00  160.0  180.00  200.0
MSFT      2.0  232.0  152.735065  124.0  178.00  232.0  286.00  340.0

In [11]:
# Temos um outro método bastante interessante que .count(). Ele conta quantas vezes o determinado 
# elemento dataframe ocorreu
df.groupby("Empresa").count()

         Nome  Venda
Empresa
FB          2      2
GOOG        2      2
MSFT        2      2

In [15]:
# Podemos usar o método .groupby() de diferentes formas
# Já conhecemos o método .loc[linha,coluna] localiza os elementos do dataframe apartir de seu indice
df.groupby("Nome").sum().loc["Ismael"]

/tmp/ipykernel_21101/1261529625.py:2: FutureWarning: The default value of numeric_only in DataFrameGroupBy.sum is deprecated. In a future version, numeric_only will default to False. Either specify numeric_only or select only columns which should be valid for the function.
  df.groupby("Nome").sum().loc["Ismael"]

Venda    124
Name: Ismael, dtype: int64